# 7. Дана строка

my_str = "Сначала выведите третий символ этой строки"

# Вывод решения задачи
print(f"1. {my_str[2]} \n2. {my_str[-2]} \n3. {my_str[0:5]} \n4. {my_str[:-2]} "
      f"\n5. {my_str[::2]} \n6. {my_str[1::2]} \n7. {my_str[::-1]} \n8. {my_str[::-2]}"
      f"\n9. {len(my_str)}")


